{ "count": 2, "movies": [{ "id": 1, "title":"101 Dalmatians", "year":1996, "rating":"G", "cast":["Glenn Close","Jeff Daniels","Joely Richardson","Joan Plowright"], "quotes":["All right. Keep the little beasts. Do what you like with them. Drown them, for all I care.", "Oh, yes! I love the smell of near extinction!"], "genres":["Comedy"], "description": "After a wild chase in the bustling streets of London, the struggling computer game author, Roger, and his male Dalmatian pet, Pongo--by a welcome twist of fate--are dragged into St. James Park and meet with the charming fashion designer, Anita, and her female Dalmatian companion, Perdita. Soon, one thing will lead to another, and before they know it, Roger and Anita will get married and the adorable Perdita, pregnant. However, their short-lived joy is disrupted when Anita's glamorous but horrible boss, Cruella DeVil, dognaps the innocent puppies with the intention of making a luxurious coat with the dogs' fabulously spotted fur. Eventually, along with Perdita's 15 pups, Cruella will manage to bring the total to the staggering number of 99 Dalmatians; nevertheless, are the cute little puppies as helpless as they look?", "imageURL": "https://m.media-amazon.com/images/M/MV5BMGI2NTQ2N2EtNDExMS00OWM2LTkzZWItZGUzY2M2MDFjODk0XkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_SY1000_CR0,0,675,1000_AL_.jpg", "bannerURL": "https://image.tmdb.org/t/p/original/xIZ2Aux90Cohe9JbziEbjEmBtv0.jpg" }, { "id": 2, "title":"The Fox and the Hound", "year":1981, "rating":"G", "cast":["Pearl Bailey","Mickey Rooney"], "quotes": ["Darling, forever is a long, long time, and time has a way of changing things.", "Oh, Big Mama, I know Copper would never track on me down. Why, Copper, he's my very best friend."], "genres":["Animated"], "description": "When an adopted fox and a to-be hunting hound become inseparable friends as pups, their friendship grows stronger every day in their 'childhood'. But as they grow older, they grow farther and farther apart, to the day when the two old comrades' bond is put to the ultimate test.", "imageURL":"https://m.media-amazon.com/images/M/MV5BMDQzZWRlYjctMjE0ZS00NWU5LWE3NzktYzZiNzJiM2UxMDczXkEyXkFqcGdeQXVyNjUwNzk3NDc@._V1_UX182_CR0,0,182,268_AL_.jpg", "bannerURL": "https://image.tmdb.org/t/p/original/87uShMszqPxwA034GsskGdzJOgN.jpg"
}] }